{
  "id": "9c04aa68-b19c-440c-a8e7-15d482e1b2ce",
  "name": "undof-reoccupation",
  "title": "Peace and Security Pillar: Reoccupied UNDOF Positions and United Nations Truce Supervision Organization (UNTSO) Military Observers in Observer Group Golan Positions",
  "description": "Context: Over the years of mandate, there have been instances the United Nations Disengagement Observer Force (UNDOF) in the Golan Heights and the United Nations Truce Supervision Organization's Observer Group Golan (UNTSO OGG) have vacated monitored positions due to security concerns or conflict escalation. Reoccupied positions refer to those specific locations or observation posts within the UNDOF/UNTSO area of operations that were previously abandoned or temporarily vacated but have since been reoccupied by UNDOF or OGG personnel or by the relevant parties to the conflict, often after the security situation has improved or been stabilized.   \n  \nIn UNDOF operations in the Golan Heights, the term Bravo side typically refers to one of the demilitarized zones (DMZs) established as part of the ceasefire agreements.  \n  \nData: This dataset contains information on the number of reoccupied positions, either by UNDOF or by UNTSO's OGG, on the Bravo side since 2017. Each row represents a year of data.",
  "category": "conflict",
  "organization": {
    "name": "unpeacesecurity",
    "title": "United Nations Peace and Security Data Hub"
  },
  "tags": [
    "complex emergency-conflict-security",
    "peacekeeping"
  ],
  "license": "Creative Commons Attribution for Intergovernmental Organisations (CC BY-IGO)",
  "dataset_date": "[2024-02-28T00:00:00 TO 2024-02-28T23:59:59]",
  "last_modified": "2025-10-24T09:43:10.693716",
  "data_update_frequency": "-2",
  "num_resources": 1,
  "resources": [
    {
      "id": "a0b9f65c-c5bd-464f-95a1-f19997c0e82c",
      "name": "undof-reoccupation.csv",
      "format": "CSV",
      "size": 237,
      "last_modified": "2025-09-05T16:59:10.660630",
      "url": "https://data.humdata.org/dataset/9c04aa68-b19c-440c-a8e7-15d482e1b2ce/resource/a0b9f65c-c5bd-464f-95a1-f19997c0e82c/download/undof-reoccupation.csv"
    }
  ],
  "source_url": "https://data.humdata.org/dataset/undof-reoccupation",
  "extracted_at": "2025-10-24T18:02:05.771Z"
}