{
  "metadata": {
    "source": "goodshepherd",
    "dataset": "child-prisoners",
    "quarter": "2023-Q4",
    "record_count": 80,
    "last_updated": "2025-10-24T18:03:09.532Z"
  },
  "data": [
    {
      "date": "2023-10-07T00:00:00.000",
      "name": "Yusef Nader Suliman Idris",
      "age": 16,
      "location": "Hebron",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while throwing stones at them along with other youths during clashes in the city.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-07T00:00:00.000",
      "name": "Ahmad 'Abd a-Rahman 'Adnan a-Rabi",
      "age": 12,
      "location": "Qalqiliya",
      "status": "detained",
      "notes": "Shot in the abdomen by soldiers while participating in clashes that included stone and explosive device throwing, as well as an attempt to set the roadblock gate on fire.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-08T00:00:00.000",
      "name": "Adam Amjad Fathi Joulani",
      "age": 17,
      "location": "a-Ram",
      "status": "detained",
      "notes": "Shot in the head by Border Police officers while driving by with friends on a road leading to a checkpoint during a fire exchange between Border Police officers and armed Palestinians as part of clashes that broke out after a protest against the Gaza war. The minor who was driving the car was injured and another minor was injured when he got out of the car and tried to run away from the officers. Earlier, Border Police officers fatally shot two other Palestinians who drove by and soldiers or officers fatally shot a minor who ran away after throwing a Molotov cocktail, which went out immediately, at a military tower.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-08T00:00:00.000",
      "name": "Yasser Thaer Sami Kusbah",
      "age": 17,
      "location": "Qalandiya Camp",
      "status": "detained",
      "notes": "Fatally shot by soldiers or Border Police officers when fleeing after throwing a Molotov cocktail, which went out immediately, at a military tower at the checkpoint during clashes that broke out after a demonstration against the war in Gaza. Later, Border Police officers fatally shot three other Palestinians who were traveling on the road leading to the checkpoint in three different cars, including a minor who was in a car that drove by as the officers were engaged in a fire exchange with armed Palestinians.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-08T00:00:00.000",
      "name": "'Imad Jareh Majed 'Adili",
      "age": 16,
      "location": "Beita",
      "status": "detained",
      "notes": "Shot in the chest by soldiers when throwing a Molotov cocktail at them during clashes that broke out following a protest against the Gaza war at the entrance to the town.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-10T00:00:00.000",
      "name": "Muhammad Rif'at Muhammad 'Udwan",
      "age": 16,
      "location": "Far'on",
      "status": "detained",
      "notes": "Shot in the chest by Israeli forces while setting fire to a tire during clashes in which young men threw stones at the forces.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-11T00:00:00.000",
      "name": "Muanis Zaki Ribhe Zeidat",
      "age": 16,
      "location": "Bani Na'im",
      "status": "detained",
      "notes": "Shot in the chest by soldiers when throwing stones at them during clashes that broke out following a protest against the Gaza war at the entrance to the village.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-12T00:00:00.000",
      "name": "'Omar Ahmad 'Abd a-Rahman Asmar",
      "age": 14,
      "location": "Zeita",
      "status": "detained",
      "notes": "Injured in the groin from shots fired by soldiers standing behind a dirt mound near an agricultural gate in the separation fence, after throwing stones at them with other youths.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-13T00:00:00.000",
      "name": "Layth Ousamah Zaa'l Abu Murah",
      "age": 17,
      "location": "al-'Esawiyah",
      "status": "detained",
      "notes": "Shot in the head and chest by Border Police officers during clashes that included stone throwing and firecracker shooting, in which he participated. The clashes broke out after the funeral of a minor killed by Israeli forces in the neighborhood earlier that day.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-13T00:00:00.000",
      "name": "Muhammad Taher 'Ali Mustafa",
      "age": 16,
      "location": "al-'Esawiyah",
      "status": "detained",
      "notes": "Shot in the chest by Border Police officers while shooting firecrackers with other young men in clashes that broke out in the neighborhood. Clashes broke out again in the neighborhood after his funeral, during which Border Police officers killed another minor who took part in the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-13T00:00:00.000",
      "name": "Amir Raafat Mahmoud Malitat",
      "age": 13,
      "location": "Beit Furik",
      "status": "detained",
      "notes": "Fatally shot by soldiers staffing the checkpoint at the entrance to the village while throwing stones at them with other youths during a protest against the war in Gaza that went from the center of the village towards the checkpoint.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-13T00:00:00.000",
      "name": "Ayham Iyad 'Issa Jabarin",
      "age": 17,
      "location": "Sa'ir",
      "status": "detained",
      "notes": "Shot in the head by soldiers or Border Police officers while firing firecrackers at them along with other youths during clashes that included stone-throwing.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-13T00:00:00.000",
      "name": "Raafat Thaer Ahmad Abu Mhanna",
      "age": 17,
      "location": "Shweikah",
      "status": "detained",
      "notes": "Fatally shot by soldiers at the Tulkarm checkpoint after he or a Palestinian traveling with him in a car fired at them.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-15T00:00:00.000",
      "name": "Karam Ayman Muhammad Dweikat",
      "age": 17,
      "location": "Beita",
      "status": "detained",
      "notes": "Shot in the abdomen and side of the body by soldiers while youths were throwing stones at settlers and soldiers who entered village lands.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-18T00:00:00.000",
      "name": "Khalil Muhammad Khalil Shalash",
      "age": 15,
      "location": "Shaqba",
      "status": "detained",
      "notes": "Injured by soldiers when trying to escape from them after he attempted to set tires on fire along with other youths on Route 446 during a protest march against the war in Gaza that proceeded out of the village towards the main road. Participants threw stones at the soldiers, set tires on fire and put up barriers. Died of his wounds shortly after. Another minor was injured in the incident. He died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-18T00:00:00.000",
      "name": "Qays Muhammad Hassan Shalash",
      "age": 17,
      "location": "Shaqba",
      "status": "detained",
      "notes": "Injured by soldiers when trying to escape from them after he attempted to set tires on fire along with other youths on Route 446 during a protest march against the war in Gaza that proceeded out of the village towards the main road. Participants threw stones at the soldiers, set tires on fire and put up barriers. Died of his wounds shortly after. Another minor was injured in the incident. He died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "Yusef 'Omar Ibrahim Zaghdad",
      "age": 11,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while standing in the street with other young men during a raid of the camp by Israeli armed forces. Nine other Palestinians were killed in the missile strike, including three more minors and an al-Aqsa Martyrs' Brigade operative. Over the course of the day, two more Palestinian minors were fatally shot. An Islamic Jihad military wing operative was killed in a fire exchange. A Border Police undercover officer was killed during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "Mujahed Muhammad Yusef Sa'aydah",
      "age": 15,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while standing in the street with other young men during a raid of the camp by Israeli armed forces. Nine other Palestinians were killed in the missile strike, including three more minors and an al-Aqsa Martyrs' Brigade operative. Over the course of the day, two more Palestinian minors were fatally shot. An Islamic Jihad military wing operative was killed in a fire exchange. A Border Police undercover officer was killed during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "'Udai Maamun Khaled Abu al-Heija",
      "age": 15,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while standing in the street with other young men during a raid of the camp by Israeli armed forces. Nine other Palestinians were killed in the missile strike, including three more minors and an al-Aqsa Martyrs' Brigade operative. Over the course of the day, two more Palestinian minors were fatally shot. An Islamic Jihad military wing operative was killed in a fire exchange. A Border Police undercover officer was killed during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "Sari 'Udai 'Ali Sadah",
      "age": 15,
      "location": "Jit",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while standing in the street with other young men during a raid of the camp by Israeli armed forces. Nine other Palestinians were killed in the missile strike, including three more minors and an al-Aqsa Martyrs' Brigade operative. Over the course of the day, two more Palestinian minors were fatally shot. An Islamic Jihad military wing operative was killed in a fire exchange. A Border Police undercover officer was killed during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "'Ali 'Abdallah Muhammad Sa'id Khaznah",
      "age": 14,
      "location": "Tulkarm",
      "status": "detained",
      "notes": "Shot in the chest by Israeli forces after throwing a stone at a military jeep during the forces’ incursion into Nur Shams R.C. Israeli forces killed 12 more Palestinians in the incident, including five minors, an al-Aqsa Martyrs' Brigade operative and an operative with the Islamic Jihad military wing who was killed during a fire exchange. Ten of the casualties that day were killed by a missile strike. A Border Police undercover unit officer was killed in the incident.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "Taha Ibrahim Muhammad 'Ali Mahamid",
      "age": 15,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Shot in the head by Israeli forces who were on their way to Nur Shams R.C. while advancing towards them on foot. That day, Israeli forces killed 12 more Palestinians, six of them minors. Ten of the casualties were killed by a missile fired from an aircraft, including four minors and one al-Aqsa Martyrs' Brigade operative. An Islamic Jihad military wing operative was killed in a fire exchange. A Border Police undercover officer was killed during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-19T00:00:00.000",
      "name": "Ahmad Munir Yusef Sadouq",
      "age": 17,
      "location": "a-Duheisheh R.C.",
      "status": "detained",
      "notes": "Shot in the head by soldiers while standing in his balcony during clashes that broke out between youths and soldiers who entered the camp to arrest workers from Gaza who were staying in one of the buildings. According to media reports, about 200 Gaza residents were arrested during the operation.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-20T00:00:00.000",
      "name": "'Udai Fawaz Fathi Mansur",
      "age": 17,
      "location": "Kafr Qalil",
      "status": "detained",
      "notes": "Fatally shot by soldiers while throwing stones at them during clashes that broke out at the checkpoint after a protest march against the Gaza war arrived from Nablus city center.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-20T00:00:00.000",
      "name": "Suhaib Iyad Muhammad a-Sus",
      "age": 15,
      "location": "Bitunya",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while running away from them after throwing stones with two other teens at military jeeps that were exiting Ramallah after arresting a Palestinian.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-22T00:00:00.000",
      "name": "'Obaydah Ahmad 'Ali Kmeil",
      "age": 14,
      "location": "Qabatiyah",
      "status": "detained",
      "notes": "Shot in the back by soldiers while throwing stones at military jeeps that entered the town during clashes that included fire exchanges with armed Palestinian.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-22T00:00:00.000",
      "name": "Muhammad Qassem Muhammad Abu Zer",
      "age": 15,
      "location": "Zawata",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while throwing stones at them along with other youths during clashes, which included explosive device throwing, that developed when the soldiers entered the village to arrest two Palestinians. Another Palestinian was killed by the soldiers' fire.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-25T00:00:00.000",
      "name": "Muhammad Anis Mahmoud Abu Qutnah",
      "age": 17,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while throwing explosive devices at Israeli forces during clashes that broke out following their incursion into the camp and the arrest of Palestinians. Abu Qutneh was an Islamic Jihad military wing operative. Three other Palestinians, including two minors, one of them an Islamic Jihad military wing operative, were killed in the incident.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-25T00:00:00.000",
      "name": "Muhammad Qadri Jamal Sabah",
      "age": 16,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while throwing explosive devices at Israeli forces during clashes that broke out following their incursion into the camp and the arrest of Palestinians. Sabah was an Islamic Jihad military wing operative. Three other Palestinians, including two Islamic Jihad military wing operatives, one of them a minor, and another minor were killed in the incident.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-25T00:00:00.000",
      "name": "'Eid Nabil 'Eid Mar'i",
      "age": 15,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while throwing explosive devices at Israeli forces during clashes that broke out following their incursion into the camp and the arrest of Palestinians. Three Islamic Jihad military wing operatives were killed in the incident, including two minors.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-25T00:00:00.000",
      "name": "Ahmad Ghaleb Ribhe Mteir",
      "age": 17,
      "location": "Qalandiya Camp",
      "status": "detained",
      "notes": "Fatally shot by soldiers while watching from the roof of his house together with relatives as Israeli forces left the camp after arresting 14 Palestinians. According to the military, while the Israeli forces operated in the camp, youths threw explosive devices and blocks at them and burned tires. Mteir's evacuation for medical treatment was delayed for about 15 minutes because the Israeli forces blocked the exit from the camp.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-26T00:00:00.000",
      "name": "Usayed Hamzah Mahmoud Hmeidat",
      "age": 15,
      "location": "Ramallah",
      "status": "detained",
      "notes": "Shot in the abdomen by soldiers while throwing stones at them along with other youths during clashes that broke out when the soldiers entered the camp to close a gate installed by the military that cuts off the home of an extended family from the camp. The settlement of Beit El was built near the home. The soldiers later shot another minor, wounding him.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-27T00:00:00.000",
      "name": "Jawwad 'Abd a-Salam Turki Qatban",
      "age": 16,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot in the back and chest by Israeli forces after throwing stones at them during clashes, which included fire exchanges, that broke out after soldiers and undercover Border Police officers entered the camp and arrested Palestinians. Two armed men, including a senior Islamic Jihad military wing operative were killed in the fire exchange.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-29T00:00:00.000",
      "name": "Yamen Kamal Ahmad 'Atiq",
      "age": 17,
      "location": "Jenin",
      "status": "detained",
      "notes": "Wounded by gunfire shot by soldiers and Border Police while clashing with them along with other youths after the forces entered the city and, according to media reports, arrested four Palestinians. According to the military, during the clashes the Palestinians threw explosives at the forces and exchanged fire with them.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-30T00:00:00.000",
      "name": "Adam Naser Mahmoud Abu al-Hawa",
      "age": 17,
      "location": "a-Tur",
      "status": "detained",
      "notes": "Fatally shot by Border Police officers at the end of a short chase on foot after he stabbed a Border Police officer. According to media reports, the officer was severely wounded. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-30T00:00:00.000",
      "name": "Musa Khaled Musa Jabarin",
      "age": 16,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile strike while participating in clashes that included fire exchanges and explosive device throwing during an incursion into the camp by soldiers, Border Police officers and Shin Bet. Three armed Palestinians were killed in the fire exchange, including two other Islamic Jihad military wing operatives.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-30T00:00:00.000",
      "name": "Muhammad 'Abd al-Qader Jaber Kharaz",
      "age": 14,
      "location": "Zawata",
      "status": "detained",
      "notes": "Wounded in the buttock and leg by shots fired by soldiers in ambush as he was about to throw a stone at a military jeep that was passing by, near the site of clashes between the soldiers and the Palestinians. Two other Palestinians who were driving by were injured in the incident, including a minor who died of his injuries on 2 November 2023.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-30T00:00:00.000",
      "name": "Hamdan 'Omar Mahmoud Hamdan",
      "age": 13,
      "location": "Nablus",
      "status": "detained",
      "notes": "Wounded in the head from shots fired by soldiers at whom Palestinian youths were throwing stones, while driving by with his uncle. His uncle was lightly injured by the gunfire. A minor who was about to throw a stone at one of the jeeps passing through the area was injured during the clashes and died of his injuries on 31 October 2023.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-10-31T00:00:00.000",
      "name": "'Abd a-Rahman Muhammad Hassan al-Jawabrah",
      "age": 16,
      "location": "Beit Ummar",
      "status": "detained",
      "notes": "Shot in the chest by soldiers who were standing on the roof of a house while throwing stones at soldiers on the ground along with other youths during clashes that developed after a demonstration against the war in Gaza.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-02T00:00:00.000",
      "name": "Ayham Muhammad Talal Shaf'i",
      "age": 12,
      "location": "al-Birah",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while trying to find cover after throwing stones at them with other teens as the soldiers were retreating from the city after arresting three Palestinians. Two other Palestinians were wounded by soldier fire during the clashes and another Palestinian who was watching the clashes was fatally shot.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-03T00:00:00.000",
      "name": "Rami 'Iz Musa 'Odeh",
      "age": 15,
      "location": "al-'Eizariyah",
      "status": "detained",
      "notes": "Wounded by soldiers’ gunfire while standing on his balcony during their withdrawal from the town after arresting Palestinians.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-03T00:00:00.000",
      "name": "Muhammad Wael 'Ata al-Ja'bari",
      "age": 16,
      "location": "Hebron",
      "status": "detained",
      "notes": "Fatally shot by soldiers when throwing stones at them during clashes that broke out following a protest against the Gaza war.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-03T00:00:00.000",
      "name": "Hamzah Zayed 'Eid Sawaftah",
      "age": 17,
      "location": "Bardalah",
      "status": "detained",
      "notes": "Fatally shot by soldiers at a checkpoint, after, according to the military, speeding towards them on his car and then getting out of it holding a knife. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-03T00:00:00.000",
      "name": "Yamen Mahmoud Nabil Jarar",
      "age": 16,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while participating in a fire exchange with soldiers who had entered the camp and arrested Palestinians. Another Islamic Jihad military wing operative, a Palestinian citizen of Israel, was also killed by a missile. A few hours earlier, the soldiers killed two other armed men. Another Palestinian who was standing on the balcony of his house watching the military jeeps leaving the camp was fatally shot in the city of Jenin.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-06T00:00:00.000",
      "name": "Muhammad 'Omar Ghanam Froukh",
      "age": 16,
      "location": "al-'Esawiyah",
      "status": "detained",
      "notes": "Fatally shot by Border Police officers after stabbing two of them, critically wounding one and lightly wounding another. The critically wounded officer died of her injuries later that day. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Sharif Ahmad 'Abd a-Rahim Sha'er",
      "age": 16,
      "location": "al-Jalameh",
      "status": "detained",
      "notes": "Wounded in the pelvis by military and Border Police gunfire during a fire exchange that broke out after the Israeli forces entered the camp and arrested more than 20 Palestinians. Fifteen other Palestinians were killed, either on the spot or later from wounds they sustained, by the Israeli forces’ gunfire, including four more minors, one of them an operative with an armed group, and eight other members of armed groups.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Muhammad 'Ali Muhammad 'Eziyah",
      "age": 17,
      "location": "'Aydah R.C.",
      "status": "detained",
      "notes": "Wounded by Israeli forces’ gunfire while on his rooftop during clashes that broke out after soldiers and Border Police officers entered the camp and arrested seven Palestinians. Soldiers stopped his father's car on its way to take him to a hospital and arrested him, injured. The military soon after notified the family their son had died of his wounds and his body was handed over to them later that morning at the a-Nashash checkpoint. The military claims that during operations in ‘Ayidah R.C. and a-Duheisheh R.C. that day, Palestinians threw Molotov cocktails and explosive devices at the soldiers.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Ahmad Mahmoud Shafiq Khalaf",
      "age": 17,
      "location": "Birqin",
      "status": "detained",
      "notes": "Shot in the chest by soldiers and Border Police officers in a fire exchange that broke out after they entered the camp and arrested more than 20 Palestinians. Fifteen other Palestinians were killed, either on the spot or later from wounds they sustained, by the Israeli forces’ gunfire, including four more minors, and seven other members of armed groups. Khalaf was an Islamic Jihad military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Muhammad Yusef 'Azzam Zayed",
      "age": 13,
      "location": "al-Yamun",
      "status": "detained",
      "notes": "Fatally shot by soldiers and Border Police officers while throwing stones and explosive devices, along with other youths, at military jeeps that were exiting the camp after arresting more than 20 Palestinians. Fifteen other Palestinians were killed, either on the spot or later from wounds they sustained, by the Israeli forces’ gunfire, including four more minors, one of them an operative with an armed group, and eight other members of armed groups.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Lutfi Sayel Mahmoud Turkman",
      "age": 12,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while near armed men who participated in a fire exchange with soldiers and Border Police officers, which broke out after they entered the camp and arrested more than 20 Palestinians. Fifteen other Palestinians were killed, either on the spot or later from wounds they sustained, by the Israeli forces’ gunfire, including four more minors, one of them an operative with an armed group, and eight other members of armed groups.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-09T00:00:00.000",
      "name": "Qays Raed Rafiq Dweikat",
      "age": 14,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while participating in a fire exchange with soldiers and Border Police officers, which broke out after they entered the camp and arrested more than 20 Palestinians. Fifteen other Palestinians were killed, either on the spot or later from wounds they sustained, by the Israeli forces’ gunfire, including four more minors, one of them an operative with an armed group, and eight other members of armed groups.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-16T00:00:00.000",
      "name": "Nasrallah 'Abd al-'Afo 'Abd al-Fatah al-Qawasmi",
      "age": 17,
      "location": "Hebron",
      "status": "detained",
      "notes": "Fatally shot by soldiers, Border Police officers and security guards at a checkpoint along with two other Hamas military wing operatives after they opened fire on members of the Israeli forces, wounding six of them, including a soldier who died of his wounds shortly after. Israel is holding their bodies.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-18T00:00:00.000",
      "name": "Muhammad Musa Muhammad Masimi",
      "age": 14,
      "location": "Balata R.C.",
      "status": "detained",
      "notes": "Killed inside the Fatah central headquarters in the camp when it was bombed, along with three al-Aqsa Martyrs' Brigade operatives, one of them a senior operative. Earlier, an al-Aqsa Martyrs' Brigade operative was accidentally shot by armed Palestinians. Clashes broke out following the Israeli forces’ incursion, during which Palestinians fired at them.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-22T00:00:00.000",
      "name": "Mu'taz Anas Subhi Mansur",
      "age": 14,
      "location": "Burin",
      "status": "detained",
      "notes": "Shot in the chest by soldiers during their incursion into the village, while youths threw stones at them.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-23T00:00:00.000",
      "name": "Muhammad Ibrahim Fahed Bahlul",
      "age": 10,
      "location": "Beita",
      "status": "detained",
      "notes": "Wounded in the chest by soldiers' fire while standing in the street during their incursion into the town.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-23T00:00:00.000",
      "name": "'Iz a-Din Mustafa Muhammad al-Hafi",
      "age": 17,
      "location": "Nablus",
      "status": "detained",
      "notes": "Fatally shot by soldiers and Border Police officers when riding a scooter past youths who were throwing stones at military jeeps that entered the camp and arrested Palestinians. In a video posted on social media, al-Hafi is seen riding a scooter around some youths who were throwing stones at the forces and then fled.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-25T00:00:00.000",
      "name": "Muhammad Riyad Fathi Saleh",
      "age": 15,
      "location": "Kafr 'Aqab (Jerusalem)",
      "status": "detained",
      "notes": "Fatally shot by soldiers when trying to flee after throwing an empty bottle at the Psagot settlement gate.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-25T00:00:00.000",
      "name": "'Ammar Muhammad Feisal Abu al-Wafa",
      "age": 14,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Shot in the abdomen, hand and thigh by soldiers while participating in clashes that included gunfire and explosive device throwing at soldiers and Border Police officers who entered the city of Jenin and Jenin R.C. and arrested Palestinians. Two more Palestinians were killed in the incident, one of them also a minor. Another minor was killed while watching the clashes from the window of his house. An Islamic Jihad military wing operative was killed by a missile strike.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-25T00:00:00.000",
      "name": "Mahmoud Khaled Mahmoud Abu al-Heija",
      "age": 17,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while watching clashes that included explosive device throwing and gunfire from the window of his house. The clashes broke out after soldiers and Border Police officers entered the city of Jenin and Jenin R.C. and arrested Palestinians. Two other minors who participated in the clashes were killed and an Islamic Jihad military wing operative was killed by a missile strike in the same incident.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-25T00:00:00.000",
      "name": "Ahmad Muhammad Hamed Abu al-Heija",
      "age": 16,
      "location": "al-Yamun",
      "status": "detained",
      "notes": "Shot in the chest by soldiers along with another Palestinian when they participated in clashes that included gunfire and explosive device throwing at soldiers and Border Police officers who entered the city of Jenin and Jenin R.C. and arrested Palestinians. Two more minors were killed in the incident, one of them while watching the clashes from the window of his house. An Islamic Jihad military wing operative was killed by a missile strike.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-28T00:00:00.000",
      "name": "'Amru Ahmad Jamil Abu Wahdan",
      "age": 14,
      "location": "Tayasir",
      "status": "detained",
      "notes": "Fatally shot by soldiers and Border Police officers from inside a military jeep while throwing stones at them with other teens from a rooftop as the Israeli forces were retreating from the city after arresting two Palestinians. During the arrest operation, clashes that included fire exchanges broke out in the city.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-28T00:00:00.000",
      "name": "Malek Majed 'Abd al-Fatah Dagharah",
      "age": 17,
      "location": "Kafr Ein",
      "status": "detained",
      "notes": "Shot by soldiers while trying to place obstacles on the road together with another youth, after the soldiers arrested a Palestinian in the village. Died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-29T00:00:00.000",
      "name": "Basel Suliman Tawfiq Abu al-Wafa",
      "age": 15,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while trying to set off an improvised explosive device as Israeli forces were retreating from Jenin R.C. The soldiers fatally shot another minor who tried to flee after throwing stones. During the incursion into the camp, two senior Islamic Jihad military wing operatives were killed by a missile fired from an aircraft.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-11-29T00:00:00.000",
      "name": "Adam Samer 'Othman Ghul",
      "age": 8,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot in the head by soldiers while trying to flee them after throwing stones at military jeeps with other teens as Israeli forces were retreating from Jenin R.C. The soldiers fatally shot another minor who tried to set off an improvised explosive device. During the incursion into the camp, two senior Islamic Jihad military wing operatives were killed by a missile fired from an aircraft.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-02T00:00:00.000",
      "name": "Yazan Majdi Munir 'Akub",
      "age": 14,
      "location": "Nablus",
      "status": "detained",
      "notes": "Fatally shot by soldiers at al-Marb’ah Checkpoint after, according to the military, drawing a knife and advancing towards the soldiers.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-06T00:00:00.000",
      "name": "'Omar Mahmoud Sadeq Abu Baker",
      "age": 16,
      "location": "Ya'bad",
      "status": "detained",
      "notes": "Shot in the chest by Israeli forces when throwing stones at them during clashes in which Palestinian youths threw improvised explosive devices and fired at the forces that entered the town. According to media reports, three more Palestinians were injured by the Israeli forces' fire. Died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-06T00:00:00.000",
      "name": "'Abd a-Rahman 'Imad Khaled Bani 'Odeh",
      "age": 16,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by Israeli forces’ fire while throwing stones and burning tires during clashes that broke out after a military, Border Police and Shin Bet force entered the town and arrested three Palestinians. During clashes that developed in the area, armed Palestinians fired and threw explosive devices at the forces. Another contingent of Israeli armed forces entered the nearby al-Far’ah R.C., arrested Palestinians, and, during the clashes that broke out there, killed a Palestinian youth who threw stones at them. According to media reports, 11 more Palestinians were injured by the Israeli forces' fire in the town and the camp, including at least one minor.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-08T00:00:00.000",
      "name": "Maher 'Abdallah Ahmad Jawabreh",
      "age": 14,
      "location": "al-Far'a Camp",
      "status": "detained",
      "notes": "Shot in the head by soldiers or Shin Bet forces while throwing stones at them during clashes that broke out after they entered the camp and arrested two Palestinians. During the clashes, Palestinian youths placed obstacles on the road, threw stones and explosive devices at the Israeli forces and fired at them. Five other Palestinians, including two Islamic Jihad military wing operatives, were killed in a fire exchange and six Palestinians were wounded. One of the wounded died of his wounds the next day.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-12T00:00:00.000",
      "name": "Rafiq Muhammad 'Omar Izqeili",
      "age": 16,
      "location": "Jenin",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft, along with three other Islamic Jihad military wing operatives, including another minor, when they threw explosive devices and fired at a military, Border Police and Shin Bet force that invaded the city of Jenin and Jenin R.C. and remained there for about three days. Two other military wing operatives were killed during a fire exchange, one in the camp and the other in the city. Over the next two days, seven more Palestinians were killed or died of their wounds, including two minors and three operatives in armed groups, and dozens of Palestinians were arrested.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-12T00:00:00.000",
      "name": "Thaer Shadi Fawaz Tabaji",
      "age": 17,
      "location": "Jenin",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft, along with three other Islamic Jihad military wing operatives, including another minor, when they threw explosive devices and fired at a military, Border Police and Shin Bet force that invaded the city of Jenin and Jenin R.C. and remained there for about three days. Two other military wing operatives were killed during a fire exchange, one in the camp and the other in the city. Over the next two days, seven more Palestinians were killed or died of their wounds, including two minors and three operatives in armed groups, and dozens of Palestinians were arrested.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-14T00:00:00.000",
      "name": "Bashar Haitham Ahmad Abu Zeid",
      "age": 13,
      "location": "Jenin",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft, along with three other Islamic Jihad military wing operatives, during a military, Border Police and Shin Bet invasion of the city of Jenin and Jenin R.C. that lasted roughly three days. That day, a cancer patient traveling home in an ambulance was injured by fragments from Israeli forces’ fire. She died of her wounds on 19 December 2023. Another minor who threw stones and tried to throw an improvised explosive device at military jeeps near the hospital was also fatally shot. In the remaining two days of the invasion, six more Palestinians were killed, all operatives of armed groups, two more of them minors. Dozens of Palestinians were arrested.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-14T00:00:00.000",
      "name": "Musa Ahmad Musa Khatib",
      "age": 15,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while throwing stones and trying to throw an improvised explosive device at military jeeps during clashes that broke out near Khalil a-Salman Hospital in the city during an invasion of the city of Jenin and Jenin R.C. by the military, Border Police and Shin Bet that lasted about three days. That day, a cancer patient traveling home in an ambulance was injured by fragments from Israeli forces’ fire. She died of her wounds on 19 December 2023. Four more Palestinians, a minor and three armed operatives, were struck by a missile fired from an aircraft and either killed or wounded and died later. In the remaining two days of the invasion, six more Palestinians were killed, all operatives of armed groups, two of them minors. Dozens of Palestinians were arrested.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-16T00:00:00.000",
      "name": "'Atallah Ziad 'Atallah Badahah",
      "age": 16,
      "location": "Deir 'Ammar",
      "status": "detained",
      "notes": "Shot in the chest by soldiers while present in an area where clashes erupted between them and Palestinian youths who threw stones at them as they retreated from Deir ‘Ammar R.C. According to the military, the forces entered the camp during a chase after Palestinians who threw Molotov cocktails at them. Soldiers at a fly checkpoint detained the car in which Badhah was evacuated for about 10 minutes. Died of his wounds shortly after. Two more Palestinians were wounded by soldiers’ fire during the clashes.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-18T00:00:00.000",
      "name": "Rashed Habib Ahmad 'Aydi",
      "age": 17,
      "location": "al-Far'a Camp",
      "status": "detained",
      "notes": "Shot in the shoulder while watching, with other residents, clashes that erupted near his home between local residents and soldiers who entered the camp and arrested a Palestinian. During the clashes, in which Palestinians threw stones and explosive devices at the soldiers and fired at them, another minor, who was an Islamic Jihad military wing operative, was killed while throwing an improvised explosive device. Two brothers were killed while participating in a fire exchange with the soldiers.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-18T00:00:00.000",
      "name": "Yazan Mu'in Muhammad Khatib",
      "age": 16,
      "location": "al-Far'a Camp",
      "status": "detained",
      "notes": "Shot in the head while throwing an improvised explosive device during clashes that erupted between local residents and soldiers who entered the camp and arrested a Palestinian. Two brothers were killed while participating in a fire exchange with the soldiers and another minor was killed while watching the clashes near his home. Khatib was an Islamic Jihad military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-26T00:00:00.000",
      "name": "Ahmad Muhammad Yusef Yaghi",
      "age": 17,
      "location": "al-Fawwar Camp",
      "status": "detained",
      "notes": "Wounded by shots fired by Israeli forces from the roof of an unfinished building while on his neighbors’ roof, watching clashes that broke out after the forces entered the camp. Palestinian youths threw stones and launched firecrackers at the forces during the clashes. Yaghi was evacuated in a car because the military blocked the entrance to the camp and ambulances could not reach him. Died of his wounds shortly after. Another Palestinian was fatally shot on the roof of his house.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-27T00:00:00.000",
      "name": "Ahmad 'Abd a-Rahman 'Issa Saleh",
      "age": 17,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed, along with 12 other Palestinians, by a missile fired from an aircraft while they were in al-Mahjar neighborhood, watching clashes that developed about 100 meters away after Israeli forces entered the camp. During the clashes, Palestinians threw stones and improvised explosive devices at the Israeli forces and fired at them. The military claimed explosive devices were thrown from his location, but B’Tselem’s research revealed a Palestinian threw an explosive device 50 meters away from where he and others were standing, and then fled to a forest about 250 meters away. Border Police officers delayed the ambulances that came to evacuate the wounded for about an hour. Five more Palestinians, including another minor, were killed, and six others were injured by the Israeli forces' fire.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-27T00:00:00.000",
      "name": "Hamzah Ahmad Mustafa Fahmawi",
      "age": 16,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed, along with 12 other Palestinians, by a missile fired from an aircraft while they were in al-Mahjar neighborhood, watching clashes that developed about 100 meters away after Israeli forces entered the camp. During the clashes, Palestinians threw stones and improvised explosive devices at the Israeli forces and fired at them. The military claimed explosive devices were thrown from his location, but B’Tselem’s research revealed a Palestinian threw an explosive device 50 meters away from where he and others were standing, and then fled to a forest about 250 meters away. Border Police officers delayed the ambulances that came to evacuate the wounded for about an hour. Five more Palestinians, including another minor, were killed, and seven others were injured by the Israeli forces' fire.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-29T00:00:00.000",
      "name": "Mahmoud 'Othman Muhammad Warni",
      "age": 15,
      "location": "al-'Eizariyah",
      "status": "detained",
      "notes": "Wounded in the abdomen and thigh by soldiers' gunfire near the separation fence in town, while trying to escape after throwing stones together with other youths at the military tower following a demonstration against the war in Gaza. Died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2023-12-29T00:00:00.000",
      "name": "'Ammar Muhammad 'Abd al-Fatah Abu Hussein",
      "age": 16,
      "location": "al-Fawwar Camp",
      "status": "detained",
      "notes": "Fatally shot by soldiers in his car after running over five soldiers at a military post. According to the military, one of the soldiers was seriously injured and the others were lightly to moderately injured. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    }
  ]
}