{
  "metadata": {
    "source": "goodshepherd",
    "dataset": "child-prisoners",
    "quarter": "2024-Q2",
    "record_count": 19,
    "last_updated": "2025-10-24T18:03:09.534Z"
  },
  "data": [
    {
      "date": "2024-04-08T00:00:00.000",
      "name": "Asma 'Imad Sa'ed Daraghmeh",
      "age": 17,
      "location": "Tayasir",
      "status": "detained",
      "notes": "Fatally shot by soldiers at a checkpoint after advancing towards them, holding a knife, and, according to the military, attempting to stab them. Israel is holding her body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-04-15T00:00:00.000",
      "name": "Yazan Muhammad Fawzi Shtayeh",
      "age": 17,
      "location": "Salem",
      "status": "detained",
      "notes": "Shot in the chest by undercover Border Police officers while throwing stones at them during clashes that broke out after the undercover officers entered the city together with soldiers and arrested a Palestinian. The military claims Shtayeh threw explosive devices at the forces. At least two more Palestinians were injured by the Israeli forces’ fire.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-04-19T00:00:00.000",
      "name": "Qays Fathi Ibrahim Nasrallah",
      "age": 14,
      "location": "Tulkarm",
      "status": "detained",
      "notes": "Wounded in the chest by shots fired by soldiers and Border Police officers while watching military vehicles driving to the nearby Nur a-Shams R.C., at the beginning of a raid on the camp that lasted for about two days. Security camera footage shows passersby walking on the road, and Nasrallah, who was standing with an electric scooter, being hit by a bullet and falling to the ground. Died of his wounds shortly after. During the raid, 13 more Palestinians were killed in the camp, including a Palestinian citizen of Israel, and about 40 were wounded. According to the Israeli military, eight members of the armed forces were wounded.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-04-19T00:00:00.000",
      "name": "'Ali Muhammad 'Ali 'Abdallah",
      "age": 17,
      "location": "Nur Shams R.C.",
      "status": "detained",
      "notes": "Killed during a fire exchange with Israeli soldiers and Border Police officers who entered the camp and arrested Palestinians. The Israeli forces also fired anti-tank missiles at the building where he was barricaded together with other Palestinians. During the raid that lasted for about two days, 12 more Palestinians were killed in the camp, including a Palestinian citizen of Israel, and about 40 were wounded. On their way to the camp, the Israeli forces killed another Palestinian in the city of Tulkarm. According to the Israeli military, eight members of the armed forces were wounded. 'Abdallah was an Islamic Jihad military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-04-25T00:00:00.000",
      "name": "Khaled Raed Suliman 'Aruq",
      "age": 16,
      "location": "Ramallah",
      "status": "detained",
      "notes": "Shot in the upper body by Israeli forces during clashes that developed after soldiers, Border Police and Shin Bet personnel entered a building in the city to deliver a punitive demolition order to one of the families. ‘Aruq threw stones at the forces along with other youths and then hid behind a tree. He was shot when he came out of his hiding place.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-16T00:00:00.000",
      "name": "Nur Nizar Adib a-Shihabi",
      "age": 17,
      "location": "a-Sawaneh",
      "status": "detained",
      "notes": "Shot by Border Police officers after stabbing one of them near the police station on Salah a-Din Street. Died of his wounds shortly after. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-21T00:00:00.000",
      "name": "Ousamah Muhammad Na'im 'Abd a-Latif Hajir",
      "age": 15,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot by Israeli armed forces from the roof of a building while riding a scooter, during a raid of the city of Jenin and Jenin R.C. by military, Border Police and Shin Bet forces. During the raid, Israeli forces killed 11 more Palestinians and wounded at least 15. Another Palestinian was seriously injured in an explosion when the military vehicle in which she was being transported to detention drove over an explosive device. She died of her wounds on 5 August 2024.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-21T00:00:00.000",
      "name": "Mahmoud Amjad Isma'il Hamadnah",
      "age": 15,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Shot by Israeli forces from the roof of a building under construction while riding an electric bicycle home from school. Students were dismissed early due to the military, Border Police and Shin Bet raid on the city of Jenin and Jenin R.C. During the raid, which lasted about two days, Israeli forces killed 11 more Palestinians and wounded at least 15. Another Palestinian was seriously injured in an explosion when the military vehicle in which she was being transported to detention drove over an explosive device. She died of her wounds on 5 August 2024.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-22T00:00:00.000",
      "name": "Mahmoud Fares Mahmoud al-Qarini",
      "age": 16,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Shot in the armpit by Israeli forces while throwing explosive devices at them along with other youths near the Muqat’ah in the city of Jenin, during clashes that developed after military, Border Police and Shin Bet forces raided the city of Jenin and Jenin R.C. During the raid, which lasted about two days, Israeli forces killed 11 more Palestinians and wounded at least 15. Another Palestinian was seriously injured in an explosion when the military vehicle in which she was being transported to detention drove over an explosive device. She died of her wounds on 5 August 2024.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-22T00:00:00.000",
      "name": "Wasim 'Ahed Mahmoud Jaradat",
      "age": 16,
      "location": "Silat al-Harithiya",
      "status": "detained",
      "notes": "Fatally shot by Israeli forces while holding an explosive device at the western entrance to the city of Jenin during clashes that developed after military, Border Police and Shin Bet forces raided the city of Jenin and Jenin R.C. During the raid, which lasted about two days, Israeli forces killed 11 more Palestinians and wounded at least 15. Another Palestinian was seriously injured in an explosion when the military vehicle in which she was being transported to detention drove over an explosive device. She died of her wounds on 5 August 2024.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-05-26T00:00:00.000",
      "name": "Majd Shaher Isma'il al-'Aramin",
      "age": 17,
      "location": "Sa'ir",
      "status": "detained",
      "notes": "Fatally shot by soldiers at the Beit ‘Einun intersection, after, according to the military, attempting to stab them. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-01T00:00:00.000",
      "name": "Ahmad Ashraf Walid Hmeidat",
      "age": 16,
      "location": "'Aqbat Jaber R.C.",
      "status": "detained",
      "notes": "Shot by soldiers along with another minor near the fence that separates the camp from the settlement of Vered Yeriho, around the camp’s cemetery, during clashes that developed in the camp, in which Palestinians fired and threw stones and explosive devices at Israeli armed forces. According to the military, the two had thrown Molotov cocktails at the settlement. They were arrested after being wounded, and shortly thereafter, the military announced the death of the second minor. The military announced Hmeidat’s death the next day.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-01T00:00:00.000",
      "name": "Muhammad Musa Muhammad Nabil Bitar",
      "age": 17,
      "location": "'Aqbat Jaber R.C.",
      "status": "detained",
      "notes": "Shot by soldiers along with another minor near the fence that separates the camp from the settlement of Vered Yeriho, around the camp’s cemetery, during clashes that developed in the camp, in which Palestinians fired and threw stones and explosive devices at Israeli armed forces. According to the military, the two had thrown Molotov cocktails at the settlement. They were arrested after being wounded, and shortly thereafter, the military announced his death. The military announced the second minor’s death the next day.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-06T00:00:00.000",
      "name": "'Issa Nafez Musa Jallad",
      "age": 16,
      "location": "Jenin",
      "status": "detained",
      "notes": "Fatally shot by soldiers from inside a military jeep along with his friend, when the two were riding a motorcycle about 600 meters from the cinema square in the city, where clashes between Palestinians and Israeli soldiers were underway following a military raid on Jenin R.C. Jallad and his friend apparently passed by a military jeep, which gave chase. The chase ended after about 130 meters when the soldiers fired at the two from inside the jeep from a distance of about 15 meters. The two fell to the ground, and then the jeep slowed down next to them, turned around and drove away. During the operation in Jenin R.C. that day, soldiers killed an Islamic Jihad military wing operative and arrested another Palestinian.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-10T00:00:00.000",
      "name": "Mahmoud Ibrahim Muhammad Nabrisi",
      "age": 16,
      "location": "al-Far'a Camp",
      "status": "detained",
      "notes": "Shot in the head by soldiers when warning residents that a military force had entered the camp. The military claimed he was armed. In the clashes that followed, which included stone-throwing and shooting by Palestinians at the soldiers, four Palestinians were injured and four others were arrested. During the raid, military bulldozers destroyed infrastructure in the camp.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-11T00:00:00.000",
      "name": "Ahmad Muhammad Khalil Samudi",
      "age": 17,
      "location": "al-Yamun",
      "status": "detained",
      "notes": "Shot by soldiers in the back of the neck, chest, arm, abdomen and leg, when throwing an IED at them during clashes in which Palestinians also fired at the soldiers. The clashes developed after the soldiers entered the city and surrounded a home where armed Palestinians barricaded themselves. While in the town, the Israeli forces killed five more Palestinians. In a video posted on social media, Samudi is seen being shot twice while lying wounded on the ground.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-14T00:00:00.000",
      "name": "Muhammad Murad Sa'id Hushiyeh",
      "age": 12,
      "location": "Qatanna",
      "status": "detained",
      "notes": "Wounded in the abdomen by shots fired by soldiers who raided a car wash, fired at an employee, severely wounding him as well. According to media reports, the soldiers were searching for a Palestinian driving a suspected stolen vehicle who hit a soldier at the Rantis checkpoint. Hushiyeh was on his way home when he noticed the soldiers and started running to get away from them, near a site where Palestinians were throwing stones at them. The soldiers delayed Hushiyeh’s evacuation for about 20 minutes. Later, the soldiers fired at another Palestinian, an American citizen, who was driving past a military jeep, severely wounding him.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-15T00:00:00.000",
      "name": "Sultan 'Abd a-Rahman Sultan Khatatbeh",
      "age": 15,
      "location": "Beit Furik",
      "status": "detained",
      "notes": "Shot by soldiers and Border Police officers while throwing stones at them along with other youths, after the forces entered the town. Two more Palestinians were wounded by the Israeli forces’ fire. Died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-06-20T00:00:00.000",
      "name": "Na'im 'Abd al-Ilah Na'im Samha",
      "age": 15,
      "location": "Qalqiliya",
      "status": "detained",
      "notes": "Shot by soldiers after throwing stones at them along with other minors, and then escaping. The soldiers entered the city to confiscate security cameras on the main street, where an Israeli citizen was attacked earlier, and, according to media reports, died due to a cardiac event. Samha died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    }
  ]
}