{
  "metadata": {
    "source": "goodshepherd",
    "dataset": "child-prisoners",
    "quarter": "2024-Q4",
    "record_count": 12,
    "last_updated": "2025-10-24T18:03:09.534Z"
  },
  "data": [
    {
      "date": "2024-10-03T00:00:00.000",
      "name": "Muhammad Maamun Muhammad 'Anbas",
      "age": 16,
      "location": "Tulkarm R.C.",
      "status": "detained",
      "notes": "Killed by missiles fired from an aircraft at a three-story building in a targeted killing that killed all 18 Palestinians in the building, including two other minors. 'Anbas and 13 other Palestinians, including a minor, were killed in a café on the ground floor of the building. His sister, their husband and their two children were killed in the apartment next door. According to the military, Palestinian operatives of armed groups who were in the café were planning an attack on Israeli civilians. ‘Anbas was a Hamas military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-10-03T00:00:00.000",
      "name": "Sham Muhammad Salah Abu Zahrah",
      "age": 8,
      "location": "Tulkarm R.C.",
      "status": "detained",
      "notes": "Killed with her parents and brother, a minor, in their apartment when missiles fired from an aircraft hit their three-story residential building. The missile was fired as part of a targeted killing in which all 18 Palestinians in the building were killed, including another minor. The other 14 casualties, including a minor, were killed in a café on the ground floor of the building. According to the military, Palestinian operatives of armed groups who were in the café were planning an attack on Israeli civilians.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-10-03T00:00:00.000",
      "name": "Karam Muhammad Salah Zahrah",
      "age": 5,
      "location": "Tulkarm R.C.",
      "status": "detained",
      "notes": "Killed with his parents and sister, a minor, in their apartment when missiles fired from an aircraft hit their three-story residential building. The missile was fired as part of a targeted killing in which all 18 Palestinians in the building were killed, including another minor. The other 14 casualties, including a minor, were killed in a café on the ground floor of the building. According to the military, Palestinian operatives of armed groups who were in the café were planning an attack on Israeli civilians.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-10-07T00:00:00.000",
      "name": "Hatem Sami Hisham Gheith",
      "age": 13,
      "location": "Kafr 'Aqab (Jerusalem)",
      "status": "detained",
      "notes": "Shot by Border Police officers who got out of their vehicle and fired two bullets from 30-35 meters away at a group of youths and children who were throwing stones at them. The incident occurred during clashes that developed between the Palestinians and Israeli military, Border Police and plainclothes intelligence officers who raided nearby Qalandiya R.C. In video footage, Gheith is seen picking up an object, apparently a stone, from the ground, then running away with the other youths. After taking a few steps, he is shot and collapses on the ground. He was pronounced dead at a hospital shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-10-14T00:00:00.000",
      "name": "Rayan Ibrahim Hassan a-Sayed",
      "age": 14,
      "location": "Jenin",
      "status": "detained",
      "notes": "Shot by soldiers from a military jeep, while throwing stones and an IED at armored military vehicles passing by on the street, along with other youths who had come out of schools, which were ordered to shut down due to a military and Border Police raid on the city of Jenin and Jenin R.C. The Israeli forces killed another Palestinian in a fire exchange during the raid.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-10-22T00:00:00.000",
      "name": "'Abdallah Jamal Nidal Hawash",
      "age": 11,
      "location": "Nablus",
      "status": "detained",
      "notes": "Fatally shot by soldiers while throwing stones, on his own, at a convoy of armored jeeps that were traveling on the street near his home on their way out of Nablus, after arresting a Palestinian in the Old City. ",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-11-03T00:00:00.000",
      "name": "Naji Nidal Naji Zama'arah",
      "age": 14,
      "location": "Halhul",
      "status": "detained",
      "notes": "Shot in the abdomen by soldiers in ambush along with his friend, a minor, who was wounded by the fire and escaped. The two had been throwing stones at Route 60 from a distance of about 100 meters. His body was transferred to the Red Crescent shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-11-18T00:00:00.000",
      "name": "Nur Ahmad Mustafa 'Arafat",
      "age": 17,
      "location": "Nablus",
      "status": "detained",
      "notes": "Wounded by soldiers’ gunfire after throwing stones with other youths at armored military jeeps that entered and patrolled the town. Security camera footage shows ‘Arafat fleeing with the other youths, being shot and falling. He was taken to Rafidya Hospital in the city, where he was pronounced dead.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-11-24T00:00:00.000",
      "name": "Muhammad Rabi' Jamil Hamarshah",
      "age": 16,
      "location": "Ya'bad",
      "status": "detained",
      "notes": "Shot by soldiers from inside a military jeep along with another Palestinian, while the two were throwing IEDs at the jeep as it entered the town, along with other youths. After the shooting, the jeep drove up to the wounded along with another jeep. Soldiers who came out of them shot and killed one of the wounded, as he screamed and begged them not to shoot him.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-12-03T00:00:00.000",
      "name": "'Omar Husam Ya'qub Shweiki",
      "age": 15,
      "location": "Abu Tur",
      "status": "detained",
      "notes": "Shot by undercover Border Police officers, while, according to the police, throwing stones at passing vehicles. Evacuated in an ambulance to a hospital where he died of his wounds later that day. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-12-24T00:00:00.000",
      "name": "Muhaymin Ayman Majed al-Akhras",
      "age": 16,
      "location": "Tulkarm",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft along with three other armed Palestinians during a raid on the camp by Israeli forces. Another Palestinian was killed during clashes, in which Palestinians threw stones and IEDs at the Israeli forces and fired at them, and two women were killed in their homes by another missile. Al-Akhras was an Islamic Jihad military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2024-12-25T00:00:00.000",
      "name": "Rayan Husam Mustafa Bani 'Odeh",
      "age": 17,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while with another minor who was severely injured during clashes that developed between Israeli forces who raided the town and Palestinians who fired and threw IEDs at them. According to the military, Bani ‘Odeh and other Palestinians had planted an IED.",
      "source": "goodshepherd-fallback"
    }
  ]
}