{
  "metadata": {
    "source": "goodshepherd",
    "dataset": "child-prisoners",
    "quarter": "2025-Q1",
    "record_count": 17,
    "last_updated": "2025-10-24T18:03:09.534Z"
  },
  "data": [
    {
      "date": "2025-01-05T00:00:00.000",
      "name": "Mu'taz Ahmad 'Abd al-Wahab Madani",
      "age": 16,
      "location": "Askar R.C.",
      "status": "detained",
      "notes": "Shot in the back after throwing stones at military jeeps that entered the camp along with a group of minors. Shortly before the shooting, another teen threw an IED at the jeeps. Madani was taken to Rafidya Hospital in Nablus, where he was pronounced dead.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-07T00:00:00.000",
      "name": "Suliman Mustafa Suliman Qatishat",
      "age": 17,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft along with another Palestinian, while the two tried to plant explosive devices. The military claims they were armed. The incident took place when Israeli security forces raided the town and nearby al-Far’ah R.C. and arrested Palestinians. In clashes that broke out during the raid, Palestinians fired and threw IEDs at the Israeli forces, and a military bulldozer destroyed a fence and roads. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-08T00:00:00.000",
      "name": "Rida 'Ali Ahmad Bsharat",
      "age": 8,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while playing on the street with his 10-year-old cousin, during a raid on the town and other nearby communities. The other cousin and another adult cousin who was sitting near them were also killed. During the raid, fire exchanges developed in other parts of the town. After the missile strike, soldiers arrived, removed the family members and took the three bodies. The bodies were returned to the family later that day through the Palestinian DCO. The military claims the three were misidentified as laying explosive devices.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-08T00:00:00.000",
      "name": "Hamzah 'Ammar Ahmad Bsharat",
      "age": 10,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft while playing on the street with his eight-year-old cousin, during a raid on the town and other nearby communities. The other cousin and another adult cousin who was sitting near them were also killed. During the raid, fire exchanges developed in other parts of the town. After the missile strike, soldiers arrived, removed the family members and took the three bodies. The bodies were returned to the family later that day through the Palestinian DCO. The military claims the three were misidentified as laying explosive devices.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-14T00:00:00.000",
      "name": "Mahmoud Ashraf Mustafa Gharbiyah",
      "age": 15,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Killed by missiles fired from an aircraft along with four armed Palestinians, including three brothers and another Palestinian, as they sat around a campfire on a-Sikkah Street in the center of the camp, where the electricity supply was cut off a month earlier. Four other Palestinians were wounded. No Israeli forces were present at the scene, and no clashes were taking place.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-19T00:00:00.000",
      "name": "Ahmad Rashid Rushdi Jazar",
      "age": 14,
      "location": "Sabastiya",
      "status": "detained",
      "notes": "Wounded by Israeli soldiers' gunfire from a distance of about 300 meters, when he and other children pointed a laser pen at them, after the soldiers entered the town’s western neighborhood in a military jeep and fired two shots that did not hit anyone. Jazar was driven to a hospital in Nablus, where he was pronounced dead.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-21T00:00:00.000",
      "name": "Mu'taz 'Imad Musa Abu Tabikh",
      "age": 16,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Shot in the abdomen by Israeli forces while riding an electric bicycle in the al-Ghabaz neighborhood, in an area where no clashes were taking place, when Israeli forces raided Jenin and Jenin R.C. on the first day of Operation Iron Wall in the northern West Bank. Taken to Ibn Sina hospital in the city, where he died of his wounds shortly after. That day, Israeli forces killed nine more Palestinians, including a minor, in Jenin and Jenin R.C.. The Israeli forces killed another Palestinian in the nearby village of T'innik and wounded forty others, including a physician and a nurse.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-25T00:00:00.000",
      "name": "Layla Muhammad Ayman al-Khatib",
      "age": 2,
      "location": "a-Shuhada (Ganzour)",
      "status": "detained",
      "notes": "Wounded in the head while sitting in her mother’s lap by shots fired by Israeli soldiers who had entered the street in unmarked vehicles and took over a nearby home. The family, who had heard gunfire in the street, sat down to eat their evening meal on the floor, fearing bullets would enter the house. Al-Khatib’s mother and aunt were also injured. She was driven to a medical center in nearby Qabatiyah. An ambulance then took her to a hospital, where attempts to save her failed and she was pronounced dead. The military claimed the soldiers believed an armed Palestinian was in the home and called for the occupants to vacate it over loudspeakers prior to firing. The family say they did not hear such a call.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-26T00:00:00.000",
      "name": "Adam Majdi Ahmad Sub Laban",
      "age": 16,
      "location": "Kafr 'Aqab (Jerusalem)",
      "status": "detained",
      "notes": "Wounded by undercover Border Police gunfire together with two other Palestinians, after, according to the police, they threw an explosive device at the officers near a checkpoint. Taken to a hospital in Ramallah, where he died of his wounds shortly after.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-28T00:00:00.000",
      "name": "Sadam Hussein Iyad Muhammad Rajab",
      "age": 10,
      "location": "Tulkarm",
      "status": "detained",
      "notes": "Wounded in the back by soldiers’ gunfire while standing near his front entrance. Rajab was taken to the hospital in an ambulance, while the soldiers detained his father and other neighbors who came to help him, arresting three of them. He underwent surgery at the hospital, but succumbed to his wounds 10 days later. The military initially claimed that 10-year-old Rajab was “messing with the ground in a suspicious way.” Israeli soldiers killed another Palestinian in another neighborhood of Tulkarm on the same day.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-01-29T00:00:00.000",
      "name": "Jihad Naser Yusef Bani Matar",
      "age": 17,
      "location": "Tammun",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft with nine other Palestinians, including a pair of siblings, while sitting in a yard belonging to one of them, during Operation Iron Wall in the northern West Bank. Another Palestinian was wounded in the attack. Bani Matar was an Islamic Jihad military wing operative.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-01T00:00:00.000",
      "name": "Ahmad 'Abd al-Halim Shaker Sa'di",
      "age": 14,
      "location": "Jenin",
      "status": "detained",
      "notes": "Killed by a missile fired from an aircraft that hit a group of people standing near his home. Two of his relatives were injured. Several hours later, the army fired another missile at a nearby location, killing two of his relatives while they were riding a motorcycle. The attack was carried out as part of Operation Iron Wall in the northern West Bank. Israeli armed forces were present in the city and the camp at the time, but not in the vicinity of the incident.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-01T00:00:00.000",
      "name": "Diyaa 'Omar Ahmad Saba'anah",
      "age": 15,
      "location": "Qabatiyah",
      "status": "detained",
      "notes": "Injured along with his father when a missile fired from an aircraft struck a car that passed by them while they were sitting in their car near their grocery store during Operation Iron Wall in the northern West Bank. The two Palestinians who were traveling in the car at which the missile was aimed were killed. Saba’anah was taken to a hospital, where he was hospitalized for about two weeks before succumbing to his wounds.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-12T00:00:00.000",
      "name": "Muhammad Ghassan Abu 'Abed",
      "age": 16,
      "location": "Nur Shams",
      "status": "detained",
      "notes": "Fatally shot along with a Palestinian minor in a fire exchange between them and Israeli soldiers who raided the camp during Operation Iron Wall in the northern West Bank. Another Palestinian was killed earlier in a fire exchange. According to the military, a soldier was moderately injured. Abu 'Abed was an Islamic Jihad military wing operative. Israel is holding his body.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-21T00:00:00.000",
      "name": "Ayman Nassar Muhammad Taysir al-Haymuni",
      "age": 12,
      "location": "Hebron",
      "status": "detained",
      "notes": "He was injured by soldier gunfire when he and his younger brother left their grandfather's house and went toward their uncle's house. Soldiers who approached him did not provide him with medical treatment, delayed his evacuation for a short time, and fired at a relative who tried to evacuate him. The soldiers then left the scene. Al-Haymuni was taken to a hospital in a relative's car, where doctors tried unsuccessfully to perform CPR on him and had to pronounce him dead.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-21T00:00:00.000",
      "name": "Rimas 'Omar Muhammad 'Amuri",
      "age": 13,
      "location": "Jenin R.C.",
      "status": "detained",
      "notes": "Injured in the back by soldiers’ gunfire while on her way from her home to a neighbor’s house during Operation Iron Wall in the northern West Bank. The soldiers continued to fire at the location as family members tried to evacuate her. The evacuation succeeded only several minutes after the shooting stopped, and ‘Amuri was pronounced dead upon arrival at the hospital.",
      "source": "goodshepherd-fallback"
    },
    {
      "date": "2025-02-26T00:00:00.000",
      "name": "Hamed Muhammad Fadel Nazzal",
      "age": 16,
      "location": "Qalqiliya",
      "status": "detained",
      "notes": "Shot by soldiers while throwing stones at the Eyal checkpoint along with several other teens. According to Palestinian paramedics who evacuated him, deceased, about 15 minutes after the shooting, the soldiers provided no care.",
      "source": "goodshepherd-fallback"
    }
  ]
}